# Table of Contents
## 0) Import Libraries & Dataset
## 1) Wrangle 'Em
## 2) Quality Check
## 3) Merge
## 4) Export

# 0) Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Import 'customers.csv'

df=pd.read_csv(r'/Users/sjpeterson76/Desktop/CareerFoundry/Data Immersion/Achievement 4/04-25-2021- Instacart Basket Analysis/02 Data/Original Data/customers.csv',
             index_col=False)

In [3]:
# Import 'ords_prods_merge'

opm=pd.read_pickle('/Users/sjpeterson76/Desktop/CareerFoundry/Data Immersion/Achievement 4/04-25-2021- Instacart Basket Analysis/01 Project Management/05-11-2021 - orders_products_aggregated.pkl')

# 1) Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [4]:
# Inspecting data

df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# Get general concept of dataframe

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [6]:
# Get statistics

df.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
# Get column names and save to variable 'col_names'

col_names=df.columns.tolist()
col_names

['user_id',
 'First Name',
 'Surnam',
 'Gender',
 'STATE',
 'Age',
 'date_joined',
 'n_dependants',
 'fam_status',
 'income']

In [8]:
# Assign new column names to dict

col_names_2={'First Name':'first_name',
            'Surnam':'last_name',
            'Gender':'gender',
            'STATE':'state',
            'Age':'age'}

In [9]:
# Assign new column names to dataframe

df=df.rename(columns=col_names_2)

In [10]:
# Checking dataframe

df.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 2) Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [11]:
# Find missing values

df.isnull().sum()

user_id             0
first_name      11259
last_name           0
gender              0
state               0
age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [12]:
# Create a new dataframe containing only the null values

df_nan=df[df['first_name'].isnull()==True]

In [13]:
df_nan.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819

In [14]:
# Drop 'first_name' and assign new dataframe to new variable 'df_2'

df_2=df.drop(columns='first_name')

In [15]:
# Check solution

df_2.head()

,user_id,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [16]:
# Find duplicates

df_dups=df_2[df.duplicated()]

In [17]:
df_dups.shape

(0, 9)

### - No duplicates!

In [18]:
# Check for datatype consistency

for col in df_2.columns.tolist():
  weird = (df_2[[col]].applymap(type) != df_2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_2[weird]) > 0:
    print (col)

### - No results = datatype consistency

# 3) Combine your customer data with the rest of your prepared Instacart data.

In [19]:
# Compare opm w/ df_2

opm.columns.to_list()

['order_id',
 'user_id',
 'eval_set',
 'order_number',
 'orders_day_of_week',
 'order_hour_of_day',
 'days_since_prior_order',
 'product_id',
 'add_to_cart_order',
 'reordered',
 'Unnamed: 0',
 'product_name',
 'aisle_id',
 'department_id',
 'prices',
 '_merge',
 'max_order',
 'loyalty_flag',
 'avg_spending_price',
 'spending_flag',
 'median_dspo',
 'frequency_flag']

In [20]:
df_2.columns.to_list()

['user_id',
 'last_name',
 'gender',
 'state',
 'age',
 'date_joined',
 'n_dependants',
 'fam_status',
 'income']

In [21]:
# Combine on 'user_id'

df_merged=df_2.merge(opm,on=['user_id'])

In [22]:
# Get view post merge view

df_merged.head()

,user_id,last_name,gender,state,age,date_joined,n_dependants,fam_status,income,order_id,...,aisle_id,department_id,prices,_merge,max_order,loyalty_flag,avg_spending_price,spending_flag,median_dspo,frequency_flag
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2543867,...,77,7,9.0,both,8,New customer,8.205882,Low spender,19.0,Regular customer
1,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,1285508,...,77,7,9.0,both,8,New customer,8.205882,Low spender,19.0,Regular customer
2,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2578584,...,77,7,9.0,both,8,New customer,8.205882,Low spender,19.0,Regular customer
3,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,423547,...,120,16,12.6,both,8,New customer,8.205882,Low spender,19.0,Regular customer
4,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2524893,...,120,16,12.6,both,8,New customer,8.205882,Low spender,19.0,Regular customer

In [23]:
# Do our rows and columns add up correctly?

df_2.shape

(206209, 9)

In [24]:
opm.shape

(30328763, 22)

In [25]:
df_merged.shape

(30328763, 30)

# 4) Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [26]:
df_merged.to_pickle('/Users/sjpeterson76/Desktop/CareerFoundry/Data Immersion/Achievement 4/04-25-2021- Instacart Basket Analysis/02 Data/Prepared Data/customers_opm.pkl')